Repository: finergy-tech/mia-pay-gateway-for-woocommerce
Catalog: languages/mia-pos-payment-gateway-for-woocommerce-*.po
Languages: ro_ro, ru_ru

source: Accept payments in your WooCommerce store using MIA POS payment gateway.
ro_ro: Acceptați plăți în magazinul dvs. WooCommerce utilizând gateway-ul de plată MIA POS.
ru_ru: Принимайте платежи в вашем магазине WooCommerce с помощью платежного шлюза MIA POS.

source: Add these URLs to your MIA POS merchant cabinet
ro_ro: Adăugați aceste URL-uri în cabinetul de comerciant MIA POS.
ru_ru: Добавьте эти URL-адреса в кабинет торговца MIA POS.

source: API Base URL
ro_ro: URL de bază mia pos Ecomm
ru_ru: Базовый URL API

source: Callback URL
ro_ro: URL de notificare (Callback URL)
ru_ru: URL уведомления (Callback URL)

source: Currency %s is not supported. Supported currencies: %s
ro_ro: Valuta %s nu este acceptată. Valute acceptate: %s
ru_ru: Валюта %s не поддерживается. Поддерживаемые валюты: %s

source: Debug mode
ro_ro: Mod de depanare
ru_ru: Режим отладки

source: Default status
ro_ro: Status implicit
ru_ru: Статус по умолчанию

source: Description
ro_ro: Descriere
ru_ru: Описание

source: Enable logging
ro_ro: Activare înregistrare loguri
ru_ru: Включить логирование

source: Enable MIA POS Payment
ro_ro: Activare plată MIA POS
ru_ru: Включить платежи через MIA POS

source: Enable Test Mode
ro_ro: Activare Mod Test
ru_ru: Включить тестовый режим

source: Enable/Disable
ro_ro: Activare/Dezactivare
ru_ru: Включить/Отключить

source: Endpoint URLs
ro_ro: URL-uri endpoint
ru_ru: Конечные URL-адреса

source: English
ro_ro: Engleză
ru_ru: Английский

source: Enter MIA POS API base URL.
ro_ro: Introduceți URL-ul de bază al API-ului MIA POS.
ru_ru: Укажите базовый URL API MIA POS.

source: Enter your Merchant ID provided by MIA POS.
ro_ro: Introduceți ID-ul de comerciant furnizat de MIA POS.
ru_ru: Укажите ID торговца, предоставленный MIA POS.

source: Enter your Secret Key provided by MIA POS.
ro_ro: Introduceți cheia secretă furnizată de MIA POS.
ru_ru: Укажите секретный ключ, предоставленный MIA POS.

source: Enter your Terminal ID provided by MIA POS.
ro_ro: Introduceți ID-ul terminalului furnizat de MIA POS.
ru_ru: Укажите ID терминала, предоставленный MIA POS.

source: Fail URL
ro_ro: URL pentru eșuare
ru_ru: URL для неудачных платежей

source: Language
ro_ro: Limbă
ru_ru: Язык

source: Merchant ID
ro_ro: ID-ul comerciantului
ru_ru: ID торговца

source: MIA POS Payment
ro_ro: Plată MIA POS
ru_ru: Оплата MIA POS

source: MIA POS payment details: %s, source (%s)
ro_ro: Detalii plată MIA POS: %s, sursa (%s)
ru_ru: Детали платежа MIA POS: %s, источник (%s)

source: MIA POS payment failed: %s
ro_ro: Plata MIA POS a eșuat: %s
ru_ru: Оплата через MIA POS не удалась: %s

source: MIA POS Payment Gateway for WooCommerce
ro_ro: Gateway-ul de Plată MIA POS pentru WooCommerce
ru_ru: Платежный шлюз MIA POS для WooCommerce

source: MIA POS Payment Gateway is not properly configured.
ro_ro: Gateway-ul de Plată MIA POS nu este configurat corect.
ru_ru: Платежный шлюз MIA POS настроен неправильно.

source: MIA POS Payment Gateway requires WooCommerce to be installed and active. You can download %s here.
ro_ro: Gateway-ul de Plată MIA POS necesită ca WooCommerce să fie instalat și activ. Puteți descărca %s aici.
ru_ru: Платежный шлюз MIA POS требует установки и активации WooCommerce. Вы можете скачать %s здесь.

source: MIA POS payment initiated. Payment ID: %s, Amount: %s %s
ro_ro: Plata MIA POS inițiată. ID-ul plății: %s, Sumă: %s %s
ru_ru: Начата оплата через MIA POS. ID платежа: %s, Сумма: %s %s

source: Order #%1$s payment verification failed %2$s.
ro_ro: Verificarea plății pentru comanda #%1$s a eșuat %2$s.
ru_ru: Проверка оплаты заказа #%1$s не удалась %2$s.

source: Order not found.
ro_ro: Comanda nu a fost găsită.
ru_ru: Заказ не найден.

source: Order status
ro_ro: Statusul comenzii
ru_ru: Статус заказа

source: Order status when payment failed. By default: Failed.
ro_ro: Statusul comenzii când plata a eșuat. Implicit: Eșuată.
ru_ru: Статус заказа при неудачной оплате. По умолчанию: Неудача.

source: Pay securely using MIA POS payment system.
ro_ro: Plătiți în siguranță utilizând sistemul de plată MIA POS.
ru_ru: Оплачивайте безопасно с помощью платежной системы MIA POS.

source: Pay with MIA POS
ro_ro: Plătiți cu MIA POS
ru_ru: Оплатить через MIA POS

source: Payment completed
ro_ro: Plata finalizată
ru_ru: Платеж завершен

source: Payment error:
ro_ro: Eroare de plată:
ru_ru: Ошибка оплаты:

source: Payment failed
ro_ro: Plata a eșuat
ru_ru: Платеж не удался

source: Payment method description that the customer will see on your checkout.
ro_ro: Descrierea metodei de plată pe care clientul o va vedea la finalizarea comenzii.
ru_ru: Описание метода оплаты, которое клиент увидит на странице оформления заказа.

source: Payment Type
ro_ro: Tip de plată
ru_ru: Тип платежа

source: Payment verification failed.
ro_ro: Verificarea plății a eșuat.
ru_ru: Проверка платежа не удалась.

source: Place the payment gateway in test mode.
ro_ro: Setați gateway-ul de plată în modul de testare.
ru_ru: Установите платежный шлюз в тестовый режим.

source: Please install and activate WooCommerce before activating this plugin.
ro_ro: Vă rugăm să instalați și să activați WooCommerce înainte de a activa acest plugin.
ru_ru: Пожалуйста, установите и активируйте WooCommerce перед активацией этого плагина.

source: QR Payment
ro_ro: Plată QR
ru_ru: Оплата через QR

source: Request to Pay
ro_ro: Cerere de plată
ru_ru: Запрос на оплату

source: Romanian
ro_ro: Română
ru_ru: Румынский

source: Russian
ro_ro: Rusă
ru_ru: Русский

source: Save debug messages to the WooCommerce System Status logs.
ro_ro: Salvați mesajele de depanare în jurnalele de stare ale sistemului WooCommerce.
ru_ru: Сохраняйте сообщения отладки в системных журналах состояния WooCommerce.

source: Secret Key
ro_ro: Cheia secretă
ru_ru: Секретный ключ

source: Security check failed.
ro_ro: Verificarea de securitate a eșuat.
ru_ru: Проверка безопасности не удалась.

source: Select the default language for payment page.
ro_ro: Selectați limba implicită pentru pagina de plată.
ru_ru: Выберите язык по умолчанию для страницы оплаты.

source: Select the payment type.
ro_ro: Selectați tipul de plată.
ru_ru: Выберите тип оплаты.

source: Settings
ro_ro: Setări
ru_ru: Настройки

source: Success URL
ro_ro: URL pentru succes
ru_ru: URL для успешной оплаты

source: Terminal ID
ro_ro: ID-ul terminalului
ru_ru: ID терминала

source: Test mode
ro_ro: Mod de testare
ru_ru: Тестовый режим

source: TEST MODE ENABLED
ro_ro: MODUL DE TESTARE ACTIVAT
ru_ru: ТЕСТОВЫЙ РЕЖИМ ВКЛЮЧЕН

source: The completed order status after successful payment. By default: Processing.
ro_ro: Statusul comenzii finalizate după o plată reușită. Implicit: În procesare.
ru_ru: Статус завершенного заказа после успешной оплаты. По умолчанию: Обработка.

source: This controls the title which the user sees during checkout.
ro_ro: Aceasta controlează titlul pe care utilizatorul îl vede în timpul finalizării comenzii.
ru_ru: Это название, которое пользователь увидит при оформлении заказа.

source: Title
ro_ro: Titlu
ru_ru: Название
